import type { AuthTranslations } from '../en/auth';

export default {
    login: {
        title: 'تسجيل الدخول',
        email: 'البريد الإلكتروني',
        password: 'كلمة المرور',
        rememberMe: 'تذكرني',
        forgotPassword: 'هل نسيت كلمة المرور؟',
        submit: 'تسجيل الدخول',
    },
    register: {
        title: 'إنشاء حساب',
        name: 'الاسم',
        email: 'البريد الإلكتروني',
        password: 'كلمة المرور',
        confirmPassword: 'تأكيد كلمة المرور',
        alreadyRegistered: 'لديك حساب بالفعل؟',
        submit: 'إنشاء حساب',
    },
    forgotPassword: {
        title: 'نسيت كلمة المرور',
        description:
            'هل نسيت كلمة المرور؟ لا مشكلة. فقط أخبرنا بعنوان بريدك الإلكتروني وسنرسل لك رابطاً لإعادة تعيين كلمة المرور يتيح لك اختيار كلمة جديدة.',
        email: 'البريد الإلكتروني',
        submit: 'إرسال رابط إعادة تعيين كلمة المرور',
    },
    resetPassword: {
        title: 'إعادة تعيين كلمة المرور',
        email: 'البريد الإلكتروني',
        password: 'كلمة المرور',
        confirmPassword: 'تأكيد كلمة المرور',
        submit: 'إعادة تعيين كلمة المرور',
    },
    confirmPassword: {
        title: 'تأكيد كلمة المرور',
        description:
            'هذه منطقة آمنة من التطبيق. يرجى تأكيد كلمة المرور قبل المتابعة.',
        password: 'كلمة المرور',
        submit: 'تأكيد',
    },
    verifyEmail: {
        title: 'تفعيل البريد الإلكتروني',
        description:
            'شكراً لتسجيلك! قبل البدء، هل يمكنك تفعيل بريدك الإلكتروني بالنقر على الرابط الذي أرسلناه لك للتو؟ إذا لم تستلم الرسالة، يسعدنا إرسال رسالة أخرى.',
        linkSent:
            'تم إرسال رابط تفعيل جديد إلى عنوان البريد الإلكتروني الذي قدمته أثناء التسجيل.',
        resend: 'إعادة إرسال رسالة التفعيل',
        logOut: 'تسجيل الخروج',
    },
} satisfies AuthTranslations;
